app/controllers/myproducts_controller.rb

  def index
    @myproducts = Myproduct.all
---
SELECT "myproducts".* FROM "myproducts"

  def create

    @myproduct = Product.new(myproduct_params)

    respond_to do |format|
      if @myproduct.save
---
INSERT INTO "myproducts" ("title", "description", "image_url", "price", "bottle_size", "company", "country", "grape_type", "suit_vegetarian", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

    def set_myproduct
      @myproduct = Myproduct.find(params[:id])
---
SELECT  "myproducts".* FROM "myproducts" WHERE "myproducts"."id" = ? LIMIT 1  [["id", 2]]